Appiko/stm32h7x/H7_Simple/Src/ov7725.c
static int set_hmirror(sensor_t *sensor, int enable)
{
    uint8_t reg;
    int ret = cambus_readb(sensor->slv_addr, COM3, &reg);
    ret |= cambus_writeb(sensor->slv_addr, COM3, COM3_SET_MIRROR(reg, enable)) ;

    return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
    uint8_t reg;
    int ret = cambus_readb(sensor->slv_addr, COM3, &reg);
    ret |= cambus_writeb(sensor->slv_addr, COM3, COM3_SET_FLIP(reg, enable));

    return ret;
}

static int set_special_effect(sensor_t *sensor, sde_t sde)
{
    int ret=0;

    switch (sde) {
        case SDE_NEGATIVE:
            ret |= cambus_writeb(sensor->slv_addr, SDE, 0x46);
            break;
        case SDE_NORMAL:
            ret |= cambus_writeb(sensor->slv_addr, SDE, 0x06);
            ret |= cambus_writeb(sensor->slv_addr, UFIX, 0x80);
            ret |= cambus_writeb(sensor->slv_addr, VFIX, 0x80);
            break;
        default:
            return -1;
    }

    return ret;
}

static int set_lens_correction(sensor_t *sensor, int enable, int radi, int coef)
{
    int ret=0;

    ret |= cambus_writeb(sensor->slv_addr, LC_CTR, (enable&0x01));
    ret |= cambus_writeb(sensor->slv_addr, LC_RADI, radi);
    ret |= cambus_writeb(sensor->slv_addr, LC_COEF, coef);

    return ret;
}

/// This function is called back after each line transfer is complete,
// with a pointer to the line buffer that was used. At this point the
// DMA transfers the next line to the other half of the line buffer.
// Note:  For JPEG this function is called once (and ignored) at the end of the transfer.
void DCMI_DMAConvCpltUser(uint32_t addr)
{
    uint8_t *src = (uint8_t*) addr;
    uint8_t *dst = dest_fb;

    uint16_t *src16 = (uint16_t*) addr;
    uint16_t *dst16 = (uint16_t*) dest_fb;

    // Skip lines outside the window.
    if (line >= MAIN_FB()->y && line <= (MAIN_FB()->y + MAIN_FB()->h)) {
        switch (sensor.pixformat) {
            case PIXFORMAT_BAYER:
                dst += (line - MAIN_FB()->y) * MAIN_FB()->w;
                for (int i=0; i<MAIN_FB()->w; i++) {
                    dst[i] = src[MAIN_FB()->x + i];
                }
                break;
            case PIXFORMAT_GRAYSCALE:
                dst += (line - MAIN_FB()->y) * MAIN_FB()->w;
                if (sensor.gs_bpp == 1) {
                    // 1BPP GRAYSCALE.
                    for (int i=0; i<MAIN_FB()->w; i++) {
                        dst[i] = src[MAIN_FB()->x + i];
                    }
                } else {
                    // Extract Y channel from YUV.
                    for (int i=0; i<MAIN_FB()->w; i++) {
                        dst[i] = src[MAIN_FB()->x * 2 + i * 2];
                    }
                }
                break;
            case PIXFORMAT_YUV422:
            case PIXFORMAT_RGB565:
                dst16 += (line - MAIN_FB()->y) * MAIN_FB()->w;
                for (int i=0; i<MAIN_FB()->w; i++) {
                    dst16[i] = src16[MAIN_FB()->x + i];
                }
                break;
            case PIXFORMAT_JPEG:
                break;
            default:
                break;
        }
    }

    line++;
}

// This is the default snapshot function, which can be replaced in sensor_init functions. This function
// uses the DCMI and DMA to capture frames and each line is processed in the DCMI_DMAConvCpltUser function.
int snapshot(sensor_t *sensor, image_t *image)
{
    uint32_t status = 0;
//    bool streaming = (streaming_cb != NULL); // Streaming mode.
    bool doublebuf = false; // Use double buffers in streaming mode.
    uint32_t addr, length, tick_start;

    // Compress the framebuffer for the IDE preview, only if it's not the first frame,
    // the framebuffer is enabled and the image sensor does not support JPEG encoding.
    // Note: This doesn't run unless the IDE is connected and the framebuffer is enabled.
//    fb_update_jpeg_buffer();

    // Make sure the raw frame fits into the FB. If it doesn't it will be cropped if
    // the format is set to GS, otherwise the pixel format will be swicthed to BAYER.
//    sensor_check_buffsize();

    // Set the current frame buffer target used in the DMA line callback
    // (DCMI_DMAConvCpltUser function), in both snapshot and streaming modes.
    dest_fb = MAIN_FB()->pixels;

    // The user may have changed the MAIN_FB width or height on the last image so we need
    // to restore that here. We don't have to restore bpp because that's taken care of
    // already in the code below. Note that we do the JPEG compression above first to save
    // the FB of whatever the user set it to and now we restore.
    MAIN_FB()->w = MAIN_FB()->u;
    MAIN_FB()->h = MAIN_FB()->v;

    // We use the stored frame size to read the whole frame. Note that cropping is
    // done in the line function using the diemensions stored in MAIN_FB()->x,y,w,h.
    uint32_t w = resolution[sensor->framesize][0];
    uint32_t h = resolution[sensor->framesize][1];

    length = (w * h * 1);
    addr = (uint32_t) dest_fb;


    status = HAL_DCMI_Start_DMA (dcmi_get_dcmi_handle (),
            DCMI_MODE_SNAPSHOT, addr, length);
    
    printf("length  : %d, Addr : %d, Status : %d\n", length,addr,status);
    MAIN_FB()->w = w;
    MAIN_FB()->h = h;
    MAIN_FB()->bpp = 2;

    if (image != NULL) {
        image->w = MAIN_FB()->w;
        image->h = MAIN_FB()->h;
        image->bpp = MAIN_FB()->bpp;
        image->pixels = MAIN_FB()->pixels;

    }
    else
    {
        printf("Null Image\n");
    }

    return 0;
}


int ov7725_init(sensor_t *sensor)
{
    // Initialize sensor structure.
    sensor->gs_bpp              = 2;
    sensor->reset               = reset;
    sensor->sleep               = sleep;
    sensor->read_reg            = read_reg;
    sensor->write_reg           = write_reg;
    sensor->set_pixformat       = set_pixformat;
    sensor->set_framesize       = set_framesize;
    sensor->set_framerate       = set_framerate;
    sensor->set_contrast        = set_contrast;
    sensor->set_brightness      = set_brightness;
    sensor->set_saturation      = set_saturation;
    sensor->set_gainceiling     = set_gainceiling;
    sensor->set_colorbar        = set_colorbar;
    sensor->set_auto_gain       = set_auto_gain;
    sensor->get_gain_db         = get_gain_db;
    sensor->set_auto_exposure   = set_auto_exposure;
    sensor->get_exposure_us     = get_exposure_us;
    sensor->set_auto_whitebal   = set_auto_whitebal;
    sensor->get_rgb_gain_db     = get_rgb_gain_db;
    sensor->set_hmirror         = set_hmirror;
    sensor->set_vflip           = set_vflip;
    sensor->set_special_effect  = set_special_effect;
    sensor->set_lens_correction = set_lens_correction;
    sensor->snapshot            = snapshot;

    // Set sensor flags
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_VSYNC, 1);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_HSYNC, 0);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_PIXCK, 1);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_FSYNC, 1);
    SENSOR_HW_FLAGS_SET(sensor, SENSOR_HW_FLAGS_JPEGE, 0);

    /* Do a power cycle */
    DCMI_PWDN_HIGH();
    for(uint32_t i = 0; i < 2000; i++);

    DCMI_PWDN_LOW();
    for(uint32_t i = 0; i < 2000; i++);
    
    cambus_init();
    
    for(uint32_t i = 0; i < sizeof(default_regs); i++)
    {
        HAL_I2C_Master_Transmit (i2c_get_i2c1_handle (), sensor->slv_addr, &default_regs[i][0], 2,1000);
    }

    return 0;
}
